Cases/Hiemenz/0.orig/fi_s
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      fi_s;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 2 -3 0 0 -1 0];// V = kg*m^2/(A*s^3)

internalField   uniform	0;

boundaryField
{
    "(wall_anode|inlet|outlet)"       
    {
        type            zeroGradient;
    }
       
    wall_cathode 
    {
        type            fixedValue;
        value		uniform 0;                
    }
    
    #include "include/constantPatches"
}

// ************************************************************************* //
