Cases/Hiemenz/system/totalCurrentDensity
//*--------------------------------*- C++ -*----------------------------------*\
//| =========                 |                                                 |
//| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
//|  \\    /   O peration     | Version:  5                                     |
//|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
//|    \\/     M anipulation  |                                                 |
//\*---------------------------------------------------------------------------*/
 
totalCurrentDensity
{
        type        potentialWallFluxVoF;//
        libs        ("libpotentialWallFluxVoFFunctionObject.so");//
	patches     ("wall_anode");//("wall_anode" "wall_cathode");

}

//\*---------------------------------------------------------------------------*/

